RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/gcc/startup_MIMXRT1176_cm7.S
/* ------------------------------------------------------------------------- */
/*  @file:    startup_MIMXRT1176_cm7.s                                       */
/*  @purpose: CMSIS Cortex-M7 Core Device Startup File                       */
/*            MIMXRT1176_cm7                                                 */
/*  @version: 1.0                                                            */
/*  @date:    2020-12-29                                                     */
/*  @build:   b211122                                                        */
/* ------------------------------------------------------------------------- */
/*                                                                           */
/* Copyright 1997-2016 Freescale Semiconductor, Inc.                         */
/* Copyright 2016-2021 NXP                                                   */
/* All rights reserved.                                                      */
/*                                                                           */
/* SPDX-License-Identifier: BSD-3-Clause                                     */
/*****************************************************************************/
/* Version: GCC for ARM Embedded Processors                                  */
/*****************************************************************************/
    .syntax unified
    .arch armv7-m

    .section .isr_vector, "a"
    .align 2
    .globl __isr_vector
__isr_vector:
    .long   __StackTop                                      /* Top of Stack */
    .long   Reset_Handler                                   /* Reset Handler */
    .long   NMI_Handler                                     /* NMI Handler*/
    .long   HardFault_Handler                               /* Hard Fault Handler*/
    .long   MemManage_Handler                               /* MPU Fault Handler*/
    .long   BusFault_Handler                                /* Bus Fault Handler*/
    .long   UsageFault_Handler                              /* Usage Fault Handler*/
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   0                                               /* Reserved*/
    .long   SVC_Handler                                     /* SVCall Handler*/
    .long   DebugMon_Handler                                /* Debug Monitor Handler*/
    .long   0                                               /* Reserved*/
    .long   PendSV_Handler                                  /* PendSV Handler*/
    .long   SysTick_Handler                                 /* SysTick Handler*/

                                                            /* External Interrupts*/
    .long   DMA0_DMA16_IRQHandler                           /* DMA channel 0/16 transfer complete*/
    .long   DMA1_DMA17_IRQHandler                           /* DMA channel 1/17 transfer complete*/
    .long   DMA2_DMA18_IRQHandler                           /* DMA channel 2/18 transfer complete*/
    .long   DMA3_DMA19_IRQHandler                           /* DMA channel 3/19 transfer complete*/
    .long   DMA4_DMA20_IRQHandler                           /* DMA channel 4/20 transfer complete*/
    .long   DMA5_DMA21_IRQHandler                           /* DMA channel 5/21 transfer complete*/
    .long   DMA6_DMA22_IRQHandler                           /* DMA channel 6/22 transfer complete*/
    .long   DMA7_DMA23_IRQHandler                           /* DMA channel 7/23 transfer complete*/
    .long   DMA8_DMA24_IRQHandler                           /* DMA channel 8/24 transfer complete*/
    .long   DMA9_DMA25_IRQHandler                           /* DMA channel 9/25 transfer complete*/
    .long   DMA10_DMA26_IRQHandler                          /* DMA channel 10/26 transfer complete*/
    .long   DMA11_DMA27_IRQHandler                          /* DMA channel 11/27 transfer complete*/
    .long   DMA12_DMA28_IRQHandler                          /* DMA channel 12/28 transfer complete*/
    .long   DMA13_DMA29_IRQHandler                          /* DMA channel 13/29 transfer complete*/
    .long   DMA14_DMA30_IRQHandler                          /* DMA channel 14/30 transfer complete*/
    .long   DMA15_DMA31_IRQHandler                          /* DMA channel 15/31 transfer complete*/
    .long   DMA_ERROR_IRQHandler                            /* DMA error interrupt channels 0-15 / 16-31*/
    .long   CTI_TRIGGER_OUT0_IRQHandler                     /* CTI_TRIGGER_OUT0*/
    .long   CTI_TRIGGER_OUT1_IRQHandler                     /* CTI_TRIGGER_OUT1*/
    .long   CORE_IRQHandler                                 /* CorePlatform exception IRQ*/
    .long   LPUART1_IRQHandler                              /* LPUART1 TX interrupt and RX interrupt*/
    .long   LPUART2_IRQHandler                              /* LPUART2 TX interrupt and RX interrupt*/
    .long   LPUART3_IRQHandler                              /* LPUART3 TX interrupt and RX interrupt*/
    .long   LPUART4_IRQHandler                              /* LPUART4 TX interrupt and RX interrupt*/
    .long   LPUART5_IRQHandler                              /* LPUART5 TX interrupt and RX interrupt*/
    .long   LPUART6_IRQHandler                              /* LPUART6 TX interrupt and RX interrupt*/
    .long   LPUART7_IRQHandler                              /* LPUART7 TX interrupt and RX interrupt*/
    .long   LPUART8_IRQHandler                              /* LPUART8 TX interrupt and RX interrupt*/
    .long   LPUART9_IRQHandler                              /* LPUART9 TX interrupt and RX interrupt*/
    .long   LPUART10_IRQHandler                             /* LPUART10 TX interrupt and RX interrupt*/
    .long   LPUART11_IRQHandler                             /* LPUART11 TX interrupt and RX interrupt*/
    .long   LPUART12_IRQHandler                             /* LPUART12 TX interrupt and RX interrupt*/
    .long   LPI2C1_IRQHandler                               /* LPI2C1 interrupt*/
    .long   LPI2C2_IRQHandler                               /* LPI2C2 interrupt*/
    .long   LPI2C3_IRQHandler                               /* LPI2C3 interrupt*/
    .long   LPI2C4_IRQHandler                               /* LPI2C4 interrupt*/
    .long   LPI2C5_IRQHandler                               /* LPI2C5 interrupt*/
    .long   LPI2C6_IRQHandler                               /* LPI2C6 interrupt*/
    .long   LPSPI1_IRQHandler                               /* LPSPI1 interrupt request line to the core*/
    .long   LPSPI2_IRQHandler                               /* LPSPI2 interrupt request line to the core*/
    .long   LPSPI3_IRQHandler                               /* LPSPI3 interrupt request line to the core*/
    .long   LPSPI4_IRQHandler                               /* LPSPI4 interrupt request line to the core*/
    .long   LPSPI5_IRQHandler                               /* LPSPI5 interrupt request line to the core*/
    .long   LPSPI6_IRQHandler                               /* LPSPI6 interrupt request line to the core*/
    .long   CAN1_IRQHandler                                 /* CAN1 interrupt*/
    .long   CAN1_ERROR_IRQHandler                           /* CAN1 error interrupt*/
    .long   CAN2_IRQHandler                                 /* CAN2 interrupt*/
    .long   CAN2_ERROR_IRQHandler                           /* CAN2 error interrupt*/
    .long   CAN3_IRQHandler                                 /* CAN3 interrupt*/
    .long   CAN3_ERROR_IRQHandler                           /* CAN3 erro interrupt*/
    .long   FLEXRAM_IRQHandler                              /* FlexRAM address out of range Or access hit IRQ*/
    .long   KPP_IRQHandler                                  /* Keypad nterrupt*/
    .long   Reserved68_IRQHandler                           /* Reserved interrupt*/
    .long   GPR_IRQ_IRQHandler                              /* GPR interrupt*/
    .long   eLCDIF_IRQHandler                               /* eLCDIF interrupt*/
    .long   LCDIFv2_IRQHandler                              /* LCDIFv2 interrupt*/
    .long   CSI_IRQHandler                                  /* CSI interrupt*/
    .long   PXP_IRQHandler                                  /* PXP interrupt*/
    .long   MIPI_CSI_IRQHandler                             /* MIPI_CSI interrupt*/
    .long   MIPI_DSI_IRQHandler                             /* MIPI_DSI interrupt*/
    .long   GPU2D_IRQHandler                                /* GPU2D interrupt*/
    .long   GPIO6_Combined_0_15_IRQHandler                  /* Combined interrupt indication for GPIO6 signal 0 throughout 15*/
    .long   GPIO6_Combined_16_31_IRQHandler                 /* Combined interrupt indication for GPIO6 signal 16 throughout 31*/
    .long   DAC_IRQHandler                                  /* DAC interrupt*/
    .long   KEY_MANAGER_IRQHandler                          /* PUF interrupt*/
    .long   WDOG2_IRQHandler                                /* WDOG2 interrupt*/
    .long   SNVS_HP_NON_TZ_IRQHandler                       /* SRTC Consolidated Interrupt. Non TZ*/
    .long   SNVS_HP_TZ_IRQHandler                           /* SRTC Security Interrupt. TZ*/
    .long   SNVS_PULSE_EVENT_IRQHandler                     /* ON-OFF button press shorter than 5 secs (pulse event)*/
    .long   CAAM_IRQ0_IRQHandler                            /* CAAM interrupt queue for JQ0*/
    .long   CAAM_IRQ1_IRQHandler                            /* CAAM interrupt queue for JQ1*/
    .long   CAAM_IRQ2_IRQHandler                            /* CAAM interrupt queue for JQ2*/
    .long   CAAM_IRQ3_IRQHandler                            /* CAAM interrupt queue for JQ3*/
    .long   CAAM_RECORVE_ERRPR_IRQHandler                   /* CAAM interrupt for recoverable error*/
    .long   CAAM_RTIC_IRQHandler                            /* CAAM interrupt for RTIC*/
    .long   CDOG_IRQHandler                                 /* CDOG interrupt*/
    .long   SAI1_IRQHandler                                 /* SAI1 interrupt*/
    .long   SAI2_IRQHandler                                 /* SAI1 interrupt*/
    .long   SAI3_RX_IRQHandler                              /* SAI3 interrupt*/
    .long   SAI3_TX_IRQHandler                              /* SAI3 interrupt*/
    .long   SAI4_RX_IRQHandler                              /* SAI4 interrupt*/
    .long   SAI4_TX_IRQHandler                              /* SAI4 interrupt*/
    .long   SPDIF_IRQHandler                                /* SPDIF interrupt*/
    .long   TMPSNS_INT_IRQHandler                           /* TMPSNS interrupt*/
    .long   TMPSNS_LOW_HIGH_IRQHandler                      /* TMPSNS low high interrupt*/
    .long   TMPSNS_PANIC_IRQHandler                         /* TMPSNS panic interrupt*/
    .long   LPSR_LP8_BROWNOUT_IRQHandler                    /* LPSR 1p8 brownout interrupt*/
    .long   LPSR_LP0_BROWNOUT_IRQHandler                    /* LPSR 1p0 brownout interrupt*/
    .long   ADC1_IRQHandler                                 /* ADC1 interrupt*/
    .long   ADC2_IRQHandler                                 /* ADC2 interrupt*/
    .long   USBPHY1_IRQHandler                              /* USBPHY1 interrupt*/
    .long   USBPHY2_IRQHandler                              /* USBPHY2 interrupt*/
    .long   RDC_IRQHandler                                  /* RDC interrupt*/
    .long   GPIO13_Combined_0_31_IRQHandler                 /* Combined interrupt indication for GPIO13 signal 0 throughout 31*/
    .long   Reserved110_IRQHandler                          /* Reserved interrupt*/
    .long   DCIC1_IRQHandler                                /* DCIC1 interrupt*/
    .long   DCIC2_IRQHandler                                /* DCIC2 interrupt*/
    .long   ASRC_IRQHandler                                 /* ASRC interrupt*/
    .long   FLEXRAM_ECC_IRQHandler                          /* FlexRAM ECC fatal interrupt*/
    .long   CM7_GPIO2_3_IRQHandler                          /* CM7_GPIO2,CM7_GPIO3 interrupt*/
    .long   GPIO1_Combined_0_15_IRQHandler                  /* Combined interrupt indication for GPIO1 signal 0 throughout 15*/
    .long   GPIO1_Combined_16_31_IRQHandler                 /* Combined interrupt indication for GPIO1 signal 16 throughout 31*/
    .long   GPIO2_Combined_0_15_IRQHandler                  /* Combined interrupt indication for GPIO2 signal 0 throughout 15*/
    .long   GPIO2_Combined_16_31_IRQHandler                 /* Combined interrupt indication for GPIO2 signal 16 throughout 31*/
    .long   GPIO3_Combined_0_15_IRQHandler                  /* Combined interrupt indication for GPIO3 signal 0 throughout 15*/
    .long   GPIO3_Combined_16_31_IRQHandler                 /* Combined interrupt indication for GPIO3 signal 16 throughout 31*/
    .long   GPIO4_Combined_0_15_IRQHandler                  /* Combined interrupt indication for GPIO4 signal 0 throughout 15*/
    .long   GPIO4_Combined_16_31_IRQHandler                 /* Combined interrupt indication for GPIO4 signal 16 throughout 31*/
    .long   GPIO5_Combined_0_15_IRQHandler                  /* Combined interrupt indication for GPIO5 signal 0 throughout 15*/
    .long   GPIO5_Combined_16_31_IRQHandler                 /* Combined interrupt indication for GPIO5 signal 16 throughout 31*/
    .long   FLEXIO1_IRQHandler                              /* FLEXIO1 interrupt*/
    .long   FLEXIO2_IRQHandler                              /* FLEXIO2 interrupt*/
    .long   WDOG1_IRQHandler                                /* WDOG1 interrupt*/
    .long   RTWDOG3_IRQHandler                              /* RTWDOG3 interrupt*/
    .long   EWM_IRQHandler                                  /* EWM interrupt*/
    .long   OCOTP_READ_FUSE_ERROR_IRQHandler                /* OCOTP read fuse error interrupt*/
    .long   OCOTP_READ_DONE_ERROR_IRQHandler                /* OCOTP read fuse done interrupt*/
    .long   GPC_IRQHandler                                  /* GPC interrupt*/
    .long   MUA_IRQHandler                                  /* MUA interrupt*/
    .long   GPT1_IRQHandler                                 /* GPT1 interrupt*/
    .long   GPT2_IRQHandler                                 /* GPT2 interrupt*/
    .long   GPT3_IRQHandler                                 /* GPT3 interrupt*/
    .long   GPT4_IRQHandler                                 /* GPT4 interrupt*/
    .long   GPT5_IRQHandler                                 /* GPT5 interrupt*/
    .long   GPT6_IRQHandler                                 /* GPT6 interrupt*/
    .long   PWM1_0_IRQHandler                               /* PWM1 capture 0, compare 0, or reload 0 interrupt*/
    .long   PWM1_1_IRQHandler                               /* PWM1 capture 1, compare 1, or reload 0 interrupt*/
    .long   PWM1_2_IRQHandler                               /* PWM1 capture 2, compare 2, or reload 0 interrupt*/
    .long   PWM1_3_IRQHandler                               /* PWM1 capture 3, compare 3, or reload 0 interrupt*/
    .long   PWM1_FAULT_IRQHandler                           /* PWM1 fault or reload error interrupt*/
    .long   FLEXSPI1_IRQHandler                             /* FlexSPI1 interrupt*/
    .long   FLEXSPI2_IRQHandler                             /* FlexSPI2 interrupt*/
    .long   SEMC_IRQHandler                                 /* SEMC interrupt*/
    .long   USDHC1_IRQHandler                               /* USDHC1 interrupt*/
    .long   USDHC2_IRQHandler                               /* USDHC2 interrupt*/
    .long   USB_OTG2_IRQHandler                             /* USBO2 USB OTG2*/
    .long   USB_OTG1_IRQHandler                             /* USBO2 USB OTG1*/
    .long   ENET_IRQHandler                                 /* ENET interrupt*/
    .long   ENET_1588_Timer_IRQHandler                      /* ENET_1588_Timer interrupt*/
    .long   ENET_1G_MAC0_Tx_Rx_1_IRQHandler                 /* ENET 1G MAC0 transmit/receive 1*/
    .long   ENET_1G_MAC0_Tx_Rx_2_IRQHandler                 /* ENET 1G MAC0 transmit/receive 2*/
    .long   ENET_1G_IRQHandler                              /* ENET 1G interrupt*/
    .long   ENET_1G_1588_Timer_IRQHandler                   /* ENET_1G_1588_Timer interrupt*/
    .long   XBAR1_IRQ_0_1_IRQHandler                        /* XBAR1 interrupt*/
    .long   XBAR1_IRQ_2_3_IRQHandler                        /* XBAR1 interrupt*/
    .long   ADC_ETC_IRQ0_IRQHandler                         /* ADCETC IRQ0 interrupt*/
    .long   ADC_ETC_IRQ1_IRQHandler                         /* ADCETC IRQ1 interrupt*/
    .long   ADC_ETC_IRQ2_IRQHandler                         /* ADCETC IRQ2 interrupt*/
    .long   ADC_ETC_IRQ3_IRQHandler                         /* ADCETC IRQ3 interrupt*/
    .long   ADC_ETC_ERROR_IRQ_IRQHandler                    /* ADCETC Error IRQ interrupt*/
    .long   Reserved166_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved167_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved168_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved169_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved170_IRQHandler                          /* Reserved interrupt*/
    .long   PIT1_IRQHandler                                 /* PIT1 interrupt*/
    .long   PIT2_IRQHandler                                 /* PIT2 interrupt*/
    .long   ACMP1_IRQHandler                                /* ACMP interrupt*/
    .long   ACMP2_IRQHandler                                /* ACMP interrupt*/
    .long   ACMP3_IRQHandler                                /* ACMP interrupt*/
    .long   ACMP4_IRQHandler                                /* ACMP interrupt*/
    .long   Reserved177_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved178_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved179_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved180_IRQHandler                          /* Reserved interrupt*/
    .long   ENC1_IRQHandler                                 /* ENC1 interrupt*/
    .long   ENC2_IRQHandler                                 /* ENC2 interrupt*/
    .long   ENC3_IRQHandler                                 /* ENC3 interrupt*/
    .long   ENC4_IRQHandler                                 /* ENC4 interrupt*/
    .long   Reserved185_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved186_IRQHandler                          /* Reserved interrupt*/
    .long   TMR1_IRQHandler                                 /* TMR1 interrupt*/
    .long   TMR2_IRQHandler                                 /* TMR2 interrupt*/
    .long   TMR3_IRQHandler                                 /* TMR3 interrupt*/
    .long   TMR4_IRQHandler                                 /* TMR4 interrupt*/
    .long   SEMA4_CP0_IRQHandler                            /* SEMA4 CP0 interrupt*/
    .long   SEMA4_CP1_IRQHandler                            /* SEMA4 CP1 interrupt*/
    .long   PWM2_0_IRQHandler                               /* PWM2 capture 0, compare 0, or reload 0 interrupt*/
    .long   PWM2_1_IRQHandler                               /* PWM2 capture 1, compare 1, or reload 0 interrupt*/
    .long   PWM2_2_IRQHandler                               /* PWM2 capture 2, compare 2, or reload 0 interrupt*/
    .long   PWM2_3_IRQHandler                               /* PWM2 capture 3, compare 3, or reload 0 interrupt*/
    .long   PWM2_FAULT_IRQHandler                           /* PWM2 fault or reload error interrupt*/
    .long   PWM3_0_IRQHandler                               /* PWM3 capture 0, compare 0, or reload 0 interrupt*/
    .long   PWM3_1_IRQHandler                               /* PWM3 capture 1, compare 1, or reload 0 interrupt*/
    .long   PWM3_2_IRQHandler                               /* PWM3 capture 2, compare 2, or reload 0 interrupt*/
    .long   PWM3_3_IRQHandler                               /* PWM3 capture 3, compare 3, or reload 0 interrupt*/
    .long   PWM3_FAULT_IRQHandler                           /* PWM3 fault or reload error interrupt*/
    .long   PWM4_0_IRQHandler                               /* PWM4 capture 0, compare 0, or reload 0 interrupt*/
    .long   PWM4_1_IRQHandler                               /* PWM4 capture 1, compare 1, or reload 0 interrupt*/
    .long   PWM4_2_IRQHandler                               /* PWM4 capture 2, compare 2, or reload 0 interrupt*/
    .long   PWM4_3_IRQHandler                               /* PWM4 capture 3, compare 3, or reload 0 interrupt*/
    .long   PWM4_FAULT_IRQHandler                           /* PWM4 fault or reload error interrupt*/
    .long   Reserved208_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved209_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved210_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved211_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved212_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved213_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved214_IRQHandler                          /* Reserved interrupt*/
    .long   Reserved215_IRQHandler                          /* Reserved interrupt*/
    .long   PDM_HWVAD_EVENT_IRQHandler                      /* HWVAD event interrupt*/
    .long   PDM_HWVAD_ERROR_IRQHandler                      /* HWVAD error interrupt*/
    .long   PDM_EVENT_IRQHandler                            /* PDM event interrupt*/
    .long   PDM_ERROR_IRQHandler                            /* PDM error interrupt*/
    .long   EMVSIM1_IRQHandler                              /* EMVSIM1 interrupt*/
    .long   EMVSIM2_IRQHandler                              /* EMVSIM2 interrupt*/
    .long   MECC1_INT_IRQHandler                            /* MECC1 int*/
    .long   MECC1_FATAL_INT_IRQHandler                      /* MECC1 fatal int*/
    .long   MECC2_INT_IRQHandler                            /* MECC2 int*/
    .long   MECC2_FATAL_INT_IRQHandler                      /* MECC2 fatal int*/
    .long   XECC_FLEXSPI1_INT_IRQHandler                    /* XECC int*/
    .long   XECC_FLEXSPI1_FATAL_INT_IRQHandler              /* XECC fatal int*/
    .long   XECC_FLEXSPI2_INT_IRQHandler                    /* XECC int*/
    .long   XECC_FLEXSPI2_FATAL_INT_IRQHandler              /* XECC fatal int*/
    .long   XECC_SEMC_INT_IRQHandler                        /* XECC int*/
    .long   XECC_SEMC_FATAL_INT_IRQHandler                  /* XECC fatal int*/
    .long   ENET_QOS_IRQHandler                             /* ENET_QOS interrupt*/
    .long   ENET_QOS_PMT_IRQHandler                         /* ENET_QOS_PMT interrupt*/
    .long   DefaultISR                                      /* 234*/
    .long   DefaultISR                                      /* 235*/
    .long   DefaultISR                                      /* 236*/
    .long   DefaultISR                                      /* 237*/
    .long   DefaultISR                                      /* 238*/
    .long   DefaultISR                                      /* 239*/
    .long   DefaultISR                                      /* 240*/
    .long   DefaultISR                                      /* 241*/
    .long   DefaultISR                                      /* 242*/
    .long   DefaultISR                                      /* 243*/
    .long   DefaultISR                                      /* 244*/
